information-technology/big-data/kafka/commands.org
* check the offset according to the specifed group id
(you will see the end offset, current offset and the lag)
kafka-consumer-groups.sh --bootstrap-server localhost:6667 --new-consumer  --describe --group <group_id>

* check current offset according to the topic
kafka-run-class.sh kafka.tools.GetOffsetShell --broker-list 10.4.56.81:6667 --topic mobileoffice-test --time -1

* consume message
kafka-console-consumer.sh  --zookeeper 10.4.56.81:2181 --bootstrap-server 10.4.56.81:6667 --topic jtsc_mme_out  --property print.key=true --property print.timestamp=true --from-beginning --max-messages 10


* create topic
kafka-topics.sh --create --zookeeper localhost:2181 --replication-factor 3 --partitions 500 --topic new-kafka-test-2017-11-3



* produce message
kafka-console-producer.sh --broker-list localhost:9092 --topic test


* list topics
kafka-topics.sh --zookeeper localhost:9092  --list

* describe topic
kafka-topics.sh --zookeeper yshd-b31:2181  --describe --topic mcd_mc_mme_2


* list groups
kafka-consumer-groups.sh --zookeeper 10.4.56.81:6667 --list


* alter topic retention
./kafka-configs.sh --zookeeper yspetl11:2181,yspetl12:2181,yspetl17:2181 --entity-type topics --entity-name mc_mme_combine --alter --add-config retention.ms=3600000 (1 hour)

