information-technology/big-data/kafka/commands.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>commands</title>
<!-- 2020-01-14 Tue 17:25 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">commands</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. check the offset according to the specifed group id</a></li>
<li><a href="#sec-2">2. check current offset according to the topic</a></li>
<li><a href="#sec-3">3. consume message</a></li>
<li><a href="#sec-4">4. create topic</a></li>
<li><a href="#sec-5">5. produce message</a></li>
<li><a href="#sec-6">6. list topics</a></li>
<li><a href="#sec-7">7. describe topic</a></li>
<li><a href="#sec-8">8. list groups</a></li>
<li><a href="#sec-9">9. alter topic retention</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> check the offset according to the specifed group id</h2>
<div class="outline-text-2" id="text-1">
<p>
(you will see the end offset, current offset and the lag)<br  />
kafka-consumer-groups.sh &#x2013;bootstrap-server localhost:6667 &#x2013;new-consumer  &#x2013;describe &#x2013;group &lt;group_id&gt;<br  />
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> check current offset according to the topic</h2>
<div class="outline-text-2" id="text-2">
<p>
kafka-run-class.sh kafka.tools.GetOffsetShell &#x2013;broker-list 10.4.56.81:6667 &#x2013;topic mobileoffice-test &#x2013;time -1<br  />
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> consume message</h2>
<div class="outline-text-2" id="text-3">
<p>
kafka-console-consumer.sh  &#x2013;zookeeper 10.4.56.81:2181 &#x2013;bootstrap-server 10.4.56.81:6667 &#x2013;topic jtsc_mme_out  &#x2013;property print.key=true &#x2013;property print.timestamp=true &#x2013;from-beginning &#x2013;max-messages 10<br  />
</p>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> create topic</h2>
<div class="outline-text-2" id="text-4">
<p>
kafka-topics.sh &#x2013;create &#x2013;zookeeper localhost:2181 &#x2013;replication-factor 3 &#x2013;partitions 500 &#x2013;topic new-kafka-test-2017-11-3<br  />
</p>
</div>
</div>



<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> produce message</h2>
<div class="outline-text-2" id="text-5">
<p>
kafka-console-producer.sh &#x2013;broker-list localhost:9092 &#x2013;topic test<br  />
</p>
</div>
</div>


<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> list topics</h2>
<div class="outline-text-2" id="text-6">
<p>
kafka-topics.sh &#x2013;zookeeper localhost:9092  &#x2013;list<br  />
</p>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> describe topic</h2>
<div class="outline-text-2" id="text-7">
<p>
kafka-topics.sh &#x2013;zookeeper yshd-b31:2181  &#x2013;describe &#x2013;topic mcd_mc_mme_2<br  />
</p>
</div>
</div>


<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> list groups</h2>
<div class="outline-text-2" id="text-8">
<p>
kafka-consumer-groups.sh &#x2013;zookeeper 10.4.56.81:6667 &#x2013;list<br  />
</p>
</div>
</div>


<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> alter topic retention</h2>
<div class="outline-text-2" id="text-9">
<p>
./kafka-configs.sh &#x2013;zookeeper yspetl11:2181,yspetl12:2181,yspetl17:2181 &#x2013;entity-type topics &#x2013;entity-name mc_mme_combine &#x2013;alter &#x2013;add-config retention.ms=3600000 (1 hour)<br  />
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2020-01-14 Tue 17:25</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
